package stepik.basicstuct;

/**
 Формат входа.
 Первая строка содержит натуральное число n. Вторая строка содержит n целых чисел parent 0 , . . . , parent n−1 .
 Для каждого 0 ≤ i ≤ n − 1, parent i — родитель вершины i; если parent i = −1, то i является корнем.
 Гарантируется, что корень ровно один.
 Гарантируется, что данная последовательность задаёт дерево.

 Формат выхода. Высота дерева.
 Ограничения. 1 ≤ n ≤ 10 5 .

 Пример.
 Вход:
 5
 4 -1 4 1 1
 Выход:
 3
 */

public class HeightOfTree {
    public static void main(String[] args) {
        int height = 1;


    }
}
